---
type: PreviewControl
namespace: Autodesk.Revit.UI
version: 2024
members: 14
tags: [revit-api, class]
---

# PreviewControl

`Autodesk.Revit.UI.PreviewControl` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PreviewControl | 2013 | `public PreviewControl ( Document document , ElementId viewId )` |
| Method | AddHandler | — | `` |
| Method | ApplyAnimationClock | — | `` |
| Method | BeginAnimation | — | `` |
| Method | BeginStoryboard | — | `` |
| Method | BringIntoView | — | `` |
| Method | ClearValue | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetBinding | — | `` |
| Method | SetValue | — | `` |
| Method | TransformToAncestor | — | `` |
| Property | ScrollbarVisibility | 2014 | `public ScrollbarVisibility ScrollbarVisibility { get ; set ; }` |
| Property | UIView | 2014 | `public UIView UIView { get ; }` |
| Property | ViewId | 2013 | `public ElementId ViewId { get ; }` |